; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	thermograph1 - mode
	infrared2 - mode
	spectrograph0 - mode
	GroundStation1 - direction
	Star2 - direction
	Star0 - direction
	GroundStation3 - direction
	Star4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star2)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star16)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star2)
	(supports instrument4 infrared2)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 spectrograph0)
	(supports instrument5 thermograph1)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star0)
	(supports instrument7 infrared2)
	(supports instrument7 thermograph1)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star2)
	(supports instrument8 spectrograph0)
	(supports instrument8 infrared2)
	(calibration_target instrument8 Star2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet9)
	(supports instrument9 thermograph1)
	(supports instrument9 spectrograph0)
	(supports instrument9 infrared2)
	(calibration_target instrument9 Star2)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet7)
	(supports instrument10 infrared2)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 Star0)
	(supports instrument11 spectrograph0)
	(calibration_target instrument11 GroundStation3)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star16)
)
(:goal (and
	(have_image Star4 thermograph1)
	(have_image Phenomenon6 infrared2)
	(have_image Planet7 thermograph1)
	(have_image Phenomenon8 thermograph1)
	(have_image Planet9 thermograph1)
	(have_image Star10 infrared2)
	(have_image Planet11 thermograph1)
	(have_image Star12 infrared2)
	(have_image Phenomenon13 spectrograph0)
	(have_image Phenomenon14 thermograph1)
	(have_image Planet15 thermograph1)
	(have_image Star16 thermograph1)
	(have_image Planet17 spectrograph0)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 13
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 13
3. (turn_to satellite4 phenomenon14 star16)
   deleted: (pointing satellite4 star16)
   added: (pointing satellite4 phenomenon14)
   goals met: 0 of 13
4. (turn_to satellite4 star0 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 star0)
   goals met: 0 of 13
5. (calibrate satellite4 instrument10 star0)
   added: (calibrated instrument10)
   goals met: 0 of 13
6. (turn_to satellite4 phenomenon14 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 phenomenon14)
   goals met: 0 of 13
7. (take_image satellite4 phenomenon14 instrument10 thermograph1)
   added: (have_image phenomenon14 thermograph1)
   goals met: 1 of 13
8. (turn_to satellite4 phenomenon6 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon6)
   goals met: 1 of 13
9. (take_image satellite4 phenomenon6 instrument10 infrared2)
   added: (have_image phenomenon6 infrared2)
   goals met: 2 of 13
10. (turn_to satellite4 phenomenon8 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 phenomenon8)
   goals met: 2 of 13
11. (take_image satellite4 phenomenon8 instrument10 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 3 of 13
12. (turn_to satellite4 planet11 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 planet11)
   goals met: 3 of 13
13. (take_image satellite4 planet11 instrument10 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 4 of 13
14. (turn_to satellite4 planet15 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet15)
   goals met: 4 of 13
15. (take_image satellite4 planet15 instrument10 thermograph1)
   added: (have_image planet15 thermograph1)
   goals met: 5 of 13
16. (turn_to satellite4 planet7 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet7)
   goals met: 5 of 13
17. (take_image satellite4 planet7 instrument10 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 6 of 13
18. (turn_to satellite4 planet9 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 planet9)
   goals met: 6 of 13
19. (take_image satellite4 planet9 instrument10 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 7 of 13
20. (turn_to satellite4 star10 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 star10)
   goals met: 7 of 13
21. (take_image satellite4 star10 instrument10 infrared2)
   added: (have_image star10 infrared2)
   goals met: 8 of 13
22. (turn_to satellite4 star12 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star12)
   goals met: 8 of 13
23. (take_image satellite4 star12 instrument10 infrared2)
   added: (have_image star12 infrared2)
   goals met: 9 of 13
24. (turn_to satellite4 star16 star12)
   deleted: (pointing satellite4 star12)
   added: (pointing satellite4 star16)
   goals met: 9 of 13
25. (take_image satellite4 star16 instrument10 thermograph1)
   added: (have_image star16 thermograph1)
   goals met: 10 of 13
26. (turn_to satellite4 star4 star16)
   deleted: (pointing satellite4 star16)
   added: (pointing satellite4 star4)
   goals met: 10 of 13
27. (take_image satellite4 star4 instrument10 thermograph1)
   added: (have_image star4 thermograph1)
   goals met: 11 of 13
28. (turn_to satellite0 phenomenon13 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 phenomenon13)
   goals met: 11 of 13
29. (turn_to satellite0 star2 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star2)
   goals met: 11 of 13
30. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 11 of 13
31. (turn_to satellite0 phenomenon13 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon13)
   goals met: 11 of 13
32. (take_image satellite0 phenomenon13 instrument0 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 12 of 13
33. (turn_to satellite0 planet17 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet17)
   goals met: 12 of 13
34. (take_image satellite0 planet17 instrument0 spectrograph0)
   added: (have_image planet17 spectrograph0)
   goals met: 13 of 13
